W6D4/art_share_api_part_two_project/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    user = User.find_by(id: params[:user_id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "Real Title"], ["updated_at", "2019-11-21 20:03:47.143297"], ["id", 6]]
---
  def update
    artwork = Artwork.find_by(id: params[:id])
    if artwork.update(artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 6]]
---
  def destroy
    artwork = Artwork.find_by(id: params[:id])
    artwork.destroy unless artwork.nil?