W6D4/art_share_api_part_two_project/app/controllers/artwork_shares_controller.rb

  def create
    share = ArtworkShare.new(artwork_share_params)
    if share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 4], ["viewer_id", 1], ["created_at", "2019-11-21 22:49:01.044656"], ["updated_at", "2019-11-21 22:49:01.044656"]]

  def destroy
    share = ArtworkShare.find_by(id: params[:id])
    share.destroy unless share.nil?
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 6]]