W6D4/art_share_api_part_two_project/app/controllers/comments_controller.rb

  def index
    if params[:comment][:user_id] && params[:comment][:artwork_id]
      render json: Comment.find_by(user_id: params[:comment][:user_id], artwork_id: params[:comment][:artwork_id])
    elsif params[:comment][:user_id]
      render json: User.find_by(id: params[:comment][:user_id]).comments
    else
      render json: Artwork.find_by(id: params[:comment][:artwork_id]).comments
---
SELECT  "comments".* FROM "comments" WHERE "comments"."user_id" = $1 AND "comments"."artwork_id" = $2 LIMIT $3  [["user_id", 2], ["artwork_id", 5], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."user_id" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" IS NULL LIMIT $1  [["LIMIT", 1]]