W11D4/bench_bnb_part_1_v2/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "cY4pwnu8phssaZ3HY-eCAQ"], ["LIMIT", 1]]
---
  def current_user
    return nil unless session[:session_token]
    @current_user ||= User.find_by(session_token: session[:session_token])