W6D5/ninety-nine_cats_project/app/controllers/cats_controller.rb

  def index
    @cats = Cat.select("*").order("name ASC")
---
SELECT * FROM "cats" ORDER BY name ASC

  def create
    @cat = Cat.new(cat_params)
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "created_at", "updated_at", "color", "name", "sex", "description") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["color", "rainbow"], ["updated_at", "2019-11-23 00:19:53.777078"], ["id", 6]]