W6D3/first_routes_project/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "Ronil Bhatia"], ["email", "ronil@aa.io"]]
---
  def create
    user = User.new(user_params)
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1 WHERE "users"."id" = $2  [["name", "Ronil Bhatia2"], ["id", 3]]
---
  def update
    user = User.find(params[:id])
    if user.update(user_params)