W11D4/bench_bnb_part_1_v2/app/models/user.rb

  def self.find_by_credentials(username, password)
    user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Hina"], ["LIMIT", 1]]

  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64
    self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "UKAlBLG5bOLiCS_UplXcfw"], ["updated_at", "2020-01-16 04:07:17.152522"], ["id", 1]]