W8D1/reddit_clone_project/app/views/subs/show.html.erb

  <%= @sub.description %>
  <% @sub.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 1]]