W8D1/reddit_clone_project/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.sub_id = params[:sub_id]
    @post.user_id = current_user.id
    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "sub_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "bigmac"], ["url", "tastes"], ["content", "good"], ["sub_id", 1], ["user_id", 6], ["created_at", "2019-12-02 23:09:31.756048"], ["updated_at", "2019-12-02 23:09:31.756048"]]

  def update
    @post = Post.find(params[:id])
    if (@post.user == current_user) && @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "bigmacjhgkkhjj"], ["updated_at", "2019-12-02 23:16:18.982533"], ["id", 1]]