W8D1/reddit_clone_project/app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 5]]
---
<ul>
  <% @user.posts.each do |post| %>